# GetVertices Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TriangulatedShellComponent..::..GetVertices Method
TriangulatedShellComponent Class See Also
---
Returns the vertices of the triangulation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public IList<XYZ> GetVertices()
```

Visual Basic
---
```text
Public Function GetVertices As IList(Of XYZ)
```

Visual C++
---
```text
public:
IList<XYZ^>^ GetVertices()
```

# ### Return Value
The vertices of the triangulation.
# See Also
TriangulatedShellComponent Class
Autodesk.Revit.DB Namespace